Revit 2024 API
PresetInitialColor Constructor (PresetInitialColor)
 Creates a copy of the given preset initial color
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public PresetInitialColor(
	PresetInitialColor other
)
Visual Basic
Public Sub New ( _
	other As PresetInitialColor _
)
Visual C++
public:
PresetInitialColor(
	PresetInitialColor^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.PresetInitialColor
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PresetInitialColor Class
PresetInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace